&НаКлиенте
Процедура УстановитьВидимость()
	Если Объект.ТипКонтрагента = ПредопределенноеЗначение("Перечисление.ТипыКонтрагентов.Клиент") Тогда 
		Элементы.Наименование.Заголовок = "Ф.И.О.";
		Элементы.ДатаРожденияКлиента.Видимость = Истина; 
		Элементы.ПолКлиента.Видимость = Истина; 
		Элементы.Договор.Видимость = Ложь;
	Иначе    
		Элементы.Наименование.Заголовок = "Наименование";
		Элементы.ДатаРожденияКлиента.Видимость = Ложь; 
		Если ЗначениеЗаполнено(Объект.ДатаРожденияКлиента) Тогда 
			Объект.ДатаРожденияКлиента = '0001,01,01';
		КонецЕсли;
		Элементы.ПолКлиента.Видимость = Ложь; 
		Если ЗначениеЗаполнено(Объект.ПолКлиента) Тогда 
			Объект.ПолКлиента = "";
		КонецЕсли;
		Элементы.Договор.Видимость =  Истина;
	КонецЕсли;
КонецПроцедуры   

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры  

&НаКлиенте
Процедура ТипКонтрагентаПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры





