Процедура ВыполнитьАутентификацию(Логин) Экспорт 
	 
    Соединение    = Новый HTTPСоединение("192.168.0.101",,"MobileClient");
	Запрос        = Новый HTTPЗапрос("salon/hs/users/getUser?username="+Логин);
    Ответ        = Соединение.Получить(Запрос);    
    Если Ответ.КодСостояния = 200 Тогда
        ДанныеПользователя = ОбменСОсновнойБазой.JSONВОбъект(Ответ.ПолучитьТелоКакСтроку());
		Если НЕ ДанныеПользователя Тогда 
			Сообщить("По логину " + Логин +" пользователь не найден!");
		ИначеЕсли ПользователиИнформационнойБазы.ПолучитьПользователей().Количество() = 0 Тогда 
            АвторизоватьПользователя(Логин);
        КонецЕсли;
    Иначе 
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = СтрШаблон("При попытке аутентификации произошла ошибка!");
		СообщениеПользователю.Сообщить();
	КонецЕсли; 
	
КонецПроцедуры   

Процедура АвторизоватьПользователя(ДанныеПользователя) Экспорт
    
    НовыйПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
    НовыйПользовательИБ.Имя = ДанныеПользователя;
    НовыйПользовательИБ.Роли.Добавить(Метаданные.Роли.АвторизованныйПользователь);
    НовыйПользовательИБ.Записать();   
	    
    ТекущийПользователь = Справочники.Пользователи.НайтиПоНаименованию(ДанныеПользователя);
    Если ТекущийПользователь.Пустая() Тогда
        НовыйПользователь = Справочники.Пользователи.СоздатьЭлемент();  
        НовыйПользователь.Наименование = ДанныеПользователя;
        НовыйПользователь.Записать(); 
        ТекущийПользователь = НовыйПользователь.Ссылка; 
    КонецЕсли;
    
    ПараметрыСеанса.ТекущийПользователь = ТекущийПользователь;
   
КонецПроцедуры

Процедура Разлогиниться() Экспорт
    Если ПользователиИнформационнойБазы.ПолучитьПользователей().Количество() > 0 Тогда
        ПользователиИнформационнойБазы.ТекущийПользователь().Удалить();    
    КонецЕсли;
КонецПроцедуры
