
Процедура ОбработкаПроведения(Отказ, Режим)
		
	Движения.ТоварыНаСкладах.Записывать = Истина;
	Движения.УчётЗатрат.Записывать = Истина;
	Движения.Хозрасчетный.Записывать = Истина;
	Движения.ТоварыНаСкладах.Записать();
	Движения.УчётЗатрат.Записать(); 
	Движения.Хозрасчетный.Записать();
	
	ПакетныйЗапрос = Новый Запрос;
	ПакетныйЗапрос.Текст =
		"ВЫБРАТЬ
		|	ПоступлениеТоваровИУслугТовары.Номенклатура КАК Номенклатура,
		|	ПоступлениеТоваровИУслугТовары.Номенклатура.СчетБухгалтерскогоУчета КАК ТоварСчетБухгалтерскогоУчета,
		|	СУММА(ПоступлениеТоваровИУслугТовары.Количество) КАК Количество,
		|	СУММА(ПоступлениеТоваровИУслугТовары.Сумма) КАК Сумма
		|ИЗ
		|	Документ.ПоступлениеТоваровИУслуг.Товары КАК ПоступлениеТоваровИУслугТовары
		|ГДЕ
		|	ПоступлениеТоваровИУслугТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПоступлениеТоваровИУслугТовары.Номенклатура,
		|	ПоступлениеТоваровИУслугТовары.Номенклатура.СчетБухгалтерскогоУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПоступлениеТоваровИУслугУслуги.СтатьяЗатрат КАК СтатьяЗатрат,
		|	СУММА(ПоступлениеТоваровИУслугУслуги.Сумма) КАК Сумма,
		|	ПоступлениеТоваровИУслугУслуги.Услуга.СчетБухгалтерскогоУчета КАК УслугаСчетБухгалтерскогоУчета
		|ИЗ
		|	Документ.ПоступлениеТоваровИУслуг.Услуги КАК ПоступлениеТоваровИУслугУслуги
		|ГДЕ
		|	ПоступлениеТоваровИУслугУслуги.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПоступлениеТоваровИУслугУслуги.СтатьяЗатрат,
		|	ПоступлениеТоваровИУслугУслуги.Услуга.СчетБухгалтерскогоУчета";
	
	ПакетныйЗапрос.УстановитьПараметр("Ссылка", Ссылка);
	МассивРезультатов = ПакетныйЗапрос.ВыполнитьПакет();
	
	ВыборкаТовары = МассивРезультатов[0].Выбрать();
	Пока ВыборкаТовары.Следующий() Цикл
		Движение = Движения.ТоварыНаСкладах.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Номенклатура = ВыборкаТовары.Номенклатура;
		Движение.Склад = Склад;
		Движение.Количество = ВыборкаТовары.Количество;
		Движение.Сумма = ВыборкаТовары.Сумма;  
		
		Движение = Движения.Хозрасчетный.Добавить();
		Движение.СчетДт = ВыборкаТовары.ТоварСчетБухгалтерскогоУчета;
		Движение.СчетКт = ПланыСчетов.Хозрасчетный.РасчетыСПоставщиками;
		Движение.Период = Дата;
		Движение.Сумма = ВыборкаТовары.Сумма;
		Движение.Содержание = "Отражено поступление товарно-материальных ценностей от поставщика";
		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура] = ВыборкаТовары.Номенклатура;
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты] = Контрагент; 		
	КонецЦикла;
	
	ВыборкаУслуги = МассивРезультатов[1].Выбрать();
	Пока ВыборкаУслуги.Следующий() Цикл
		Движение = Движения.УчётЗатрат.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация; 
		Движение.СтатьяЗатрат = ВыборкаУслуги.СтатьяЗатрат;  
		Движение.Сумма = ВыборкаУслуги.Сумма;
		
		Движение = Движения.Хозрасчетный.Добавить();
		Движение.СчетДт = ВыборкаУслуги.УслугаСчетБухгалтерскогоУчета;
		Движение.СчетКт = ПланыСчетов.Хозрасчетный.РасчетыСПоставщиками;
		Движение.Период = Дата;
		Движение.Сумма = ВыборкаУслуги.Сумма;
		Движение.Содержание = "Отражено поступление услуг от поставщика"; 
		БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(Движение.СчетДт, Движение.СубконтоДт, ВыборкаУслуги.СтатьяЗатрат);
		БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(Движение.СчетКт, Движение.СубконтоКт, Контрагент);
	КонецЦикла;
	
КонецПроцедуры
