
Функция getUserМетод1(Запрос)
	Логин = Строка(Запрос.ПараметрыЗапроса.Получить("username"));
	
	ЗапросПользователи = Новый Запрос; 
	Если Логин <> "" Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(Контрагенты.Ссылка) КАК Количество
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	НЕ Контрагенты.ПометкаУдаления
		|	И Контрагенты.ПользовательМП = &Наименование";
		
		Запрос.УстановитьПараметр("Наименование", Логин);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ВыборкаДетальныеЗаписи.Количество = 0 Тогда
				НаличиеПользователя = Ложь;
			Иначе
				НаличиеПользователя = Истина;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;	
	Ответ = Новый HTTPСервисОтвет(200); 
	
	ЗаписьJSON = Новый ЗаписьJSON; 
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, НаличиеПользователя);
	СтрокаОтвета = ЗаписьJSON.Закрыть();
	
	Ответ.УстановитьТелоИзСтроки(СтрокаОтвета); 
	
	Возврат Ответ; 
	
КонецФункции


