Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ТоварыНаСкладах.Записывать = Истина; 
	Движения.ЗаказыКлиентов.Записывать = Истина;  
	Движения.Продажи.Записывать = Истина;
	Движения.УчётЗатрат.Записывать = Истина;
	Движения.Хозрасчетный.Записывать    = Истина;
	Движения.ТоварыНаСкладах.Записать();
	Движения.Продажи.Записать();
	Движения.УчётЗатрат.Записать();   
	Движения.ЗаказыКлиентов.Записать(); 
	Движения.Хозрасчетный.Записать();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ТоварыНаСкладах");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный; 
	ЭлементБлокировки.ИсточникДанных = Товары; 
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура"); 
	ЭлементБлокировки.УстановитьЗначение("Склад", Склад);
	ЭлементБлокировки.УстановитьЗначение("Организация", Организация); 
	Блокировка.Заблокировать();	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТовары.Номенклатура КАК Номенклатура,
	|	СУММА(РеализацияТовары.Количество) КАК Количество,
	|	СУММА(РеализацияТовары.Сумма) КАК Сумма,
	|	&Склад КАК Склад,
	|	&Организация КАК Организация
	|ПОМЕСТИТЬ ВТ_Номенклатура
	|ИЗ
	|	Документ.Реализация.Товары КАК РеализацияТовары
	|ГДЕ
	|	РеализацияТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТовары.Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияУслуги.Услуга,
	|	СУММА(РеализацияУслуги.Количество),
	|	СУММА(РеализацияУслуги.Сумма),
	|	&Склад,
	|	&Организация
	|ИЗ
	|	Документ.Реализация.Услуги КАК РеализацияУслуги
	|ГДЕ
	|	РеализацияУслуги.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияУслуги.Услуга
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Номенклатура.Номенклатура КАК Номенклатура,
	|	ВТ_Номенклатура.Количество КАК КоличествоВДокументе,
	|	ВТ_Номенклатура.Сумма КАК СуммаВДокументе,
	|	ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
	|	ЕСТЬNULL(ТоварыНаСкладахОстатки.СуммаОстаток, 0) КАК СтоимостьОстаток,
	|	ВЫБОР
	|		КОГДА ВТ_Номенклатура.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЭтоТовар,
	|	ВТ_Номенклатура.Номенклатура.СтатьяЗатрат КАК НоменклатураСтатьяЗатрат,
	|	ВТ_Номенклатура.Номенклатура.Представление КАК НоменклатураПредставление,
	|	ВТ_Номенклатура.Номенклатура.СчетБухгалтерскогоУчета КАК НоменклатураСчетБухгалтерскогоУчета
	|ИЗ
	|	ВТ_Номенклатура КАК ВТ_Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|				&МоментВремени,
	|				(Номенклатура, Склад, Организация) В
	|					(ВЫБРАТЬ
	|						ВТ_Товары.Номенклатура,
	|						ВТ_Товары.Склад,
	|						ВТ_Товары.Организация
	|					ИЗ
	|						ВТ_Номенклатура КАК ВТ_Товары)) КАК ТоварыНаСкладахОстатки
	|		ПО ВТ_Номенклатура.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
	|			И ВТ_Номенклатура.Склад = ТоварыНаСкладахОстатки.Склад
	|			И ВТ_Номенклатура.Организация = ТоварыНаСкладахОстатки.Организация
	|ИТОГИ
	|	МАКСИМУМ(КоличествоВДокументе),
	|	МАКСИМУМ(СуммаВДокументе),
	|	СУММА(КоличествоОстаток),
	|	СУММА(СтоимостьОстаток)
	|ПО
	|	НоменклатураСтатьяЗатрат";
	
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(МоментВремени()));
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Ссылка", Ссылка); 
	Запрос.УстановитьПараметр("Организация", Организация);   

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаНоменклатураСтатьяЗатрат = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаНоменклатураСтатьяЗатрат.Следующий() Цикл 
		
		ВыборкаДетальныеЗаписи = ВыборкаНоменклатураСтатьяЗатрат.Выбрать();
		
		СуммаЗатрат = 0;
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл	 
			
			Если ВыборкаДетальныеЗаписи.ЭтоТовар Тогда
					
				Превышение = ВыборкаДетальныеЗаписи.КоличествоВДокументе - ВыборкаДетальныеЗаписи.КоличествоОстаток;
				Если Превышение > 0 Тогда 
					Отказ = Истина;
					ТекстСообщения = СтрШаблон(НСтр("ru='Проведение запрещено. Отсутствуют остатки по номенклатуре: %1, по данному складу в количестве: %2 шт.'"), ВыборкаДетальныеЗаписи.НоменклатураПредставление, Превышение);
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, "Объект.Товары",, Отказ);
				КонецЕсли;
								
				Движение = Движения.ТоварыНаСкладах.ДобавитьРасход();
				Движение.Период = Дата; 
				Движение.Организация = Организация;
				Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
				Движение.Склад = Склад;
				Движение.Количество = ВыборкаДетальныеЗаписи.КоличествоВДокументе;
				
				Если ВыборкаДетальныеЗаписи.КоличествоВДокументе = ВыборкаДетальныеЗаписи.КоличествоОстаток Тогда
					СуммаСписания = ВыборкаДетальныеЗаписи.СтоимостьОстаток;
				Иначе    
					СуммаСписания = ВыборкаДетальныеЗаписи.КоличествоВДокументе / ВыборкаДетальныеЗаписи.КоличествоОстаток * ВыборкаДетальныеЗаписи.СтоимостьОстаток;
				КонецЕсли;
				Движение.Сумма = СуммаСписания;	
				
				Движение = Движения.Хозрасчетный.Добавить();
				Движение.СчетДт = ПланыСчетов.Хозрасчетный.Продажи;
				Движение.СчетКт = ВыборкаДетальныеЗаписи.НоменклатураСчетБухгалтерскогоУчета;
				Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура] = ВыборкаДетальныеЗаписи.Номенклатура; 
				Движение.Период    = Дата;    
				Движение.Сумма = СуммаСписания;
				Движение.Содержание    = "Списана себестоимость товарно-материальных ценностей";
				
				СуммаЗатрат = СуммаЗатрат + Движение.Сумма;
				
			КонецЕсли; 	
			
			Движение = Движения.Продажи.Добавить();
			Движение.Период = Дата; 
			Движение.Организация = Организация;
			Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
			Движение.Сотрудник = Сотрудник;
			Движение.Контрагент = Контрагент;   
			Движение.Количество = ВыборкаДетальныеЗаписи.КоличествоВДокументе;
			Движение.Сумма = ВыборкаДетальныеЗаписи.СуммаВДокументе;
			
		КонецЦикла;  
		
		Если СуммаЗатрат > 0 Тогда
			Движение = Движения.УчётЗатрат.Добавить();
			Движение.Период = Дата; 
			Движение.Организация = Организация;
			Движение.СтатьяЗатрат = ВыборкаНоменклатураСтатьяЗатрат.НоменклатураСтатьяЗатрат;
			Движение.Сумма = СуммаЗатрат;
		КонецЕсли;	
		
	КонецЦикла;	  
	
	
	Движение = Движения.Хозрасчетный.Добавить();
	Движение.СчетДт = ПланыСчетов.Хозрасчетный.РасчетыСПокупателями;
	Движение.СчетКт = ПланыСчетов.Хозрасчетный.Продажи;
	БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(Движение.СчетДт, Движение.СубконтоДт, Контрагент);
	Движение.Период = Дата;
	Движение.Сумма = СуммаДокумента;
	Движение.Содержание = "Отражена выручка от реализации товаров и услуг";	
	
	
	Если НЕ ДокументОснование.Пустая() Тогда
		Движение = Движения.ЗаказыКлиентов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Клиент = Контрагент;
		Движение.ЗаказКлиента = ДокументОснование;
		Движение.Сумма = Услуги.Итог("Сумма");	
	КонецЕсли;	
		
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПредварительнаяЗапись") Тогда

		Контрагент = ДанныеЗаполнения.Клиент;
		Комментарий = ДанныеЗаполнения.Комментарий + " Введен на основании: Предварительная запись №" + ДанныеЗаполнения.Номер + " от " + ДанныеЗаполнения.Дата;
		Организация = ДанныеЗаполнения.Организация;
		Ответственный = ДанныеЗаполнения.Ответственный;
		Сотрудник = ДанныеЗаполнения.Сотрудник;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		СуммаДокумента = ДанныеЗаполнения.СуммаДокумента;  
		
		Для Каждого ТекСтрокаУслуги Из ДанныеЗаполнения.Услуги Цикл
			НоваяСтрока = Услуги.Добавить();
			НоваяСтрока.Количество = ТекСтрокаУслуги.Количество;
			НоваяСтрока.Сумма = ТекСтрокаУслуги.Сумма;
			НоваяСтрока.Услуга = ТекСтрокаУслуги.Услуга;
			НоваяСтрока.Цена = ТекСтрокаУслуги.Цена;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры
