#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция СведенияОВнешнейОбработке() Экспорт
    
    ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("3.1.11.189");
    ПараметрыРегистрации.Информация = НСтр("ru = 'Печатная форма товарная накладная'");
    ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиПечатнаяФорма(); 
    ПараметрыРегистрации.Версия = "2.0.0.1";
	ПараметрыРегистрации.Назначение.Добавить("Документ.Реализация");   
	
    Команда = ПараметрыРегистрации.Команды.Добавить();
    Команда.Представление = НСтр("ru = 'Печатная форма товарная накладная'");
    Команда.Идентификатор = "ТоварнаяНакладная";
    Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода(); 
    Команда.Модификатор   = "ПечатьMXL"; 
    
    Возврат ПараметрыРегистрации; 
КонецФункции

#КонецОбласти 

#Область СлужебныйПрограммныйИнтерфейс

Процедура Печать(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт 
    
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "ТоварнаяНакладная"); 
	Если ПечатнаяФорма <> Неопределено Тогда
	    ПечатнаяФорма.ТабличныйДокумент = СформироватьТоварнаяНакладная(МассивОбъектов, ОбъектыПечати, ); 
	    ПечатнаяФорма.СинонимМакета = НСтр("ru = 'Товарная накладная'");
	КонецЕсли;   
	
КонецПроцедуры 

#КонецОбласти   

#Область СлужебныеПроцедурыИФункции  

Функция СформироватьТоварнаяНакладная(МассивОбъектов, ОбъектыПечати, ПараметрыПечати)   
	
	УстановитьПривилегированныйРежим(Истина);	
	ТабличныйДокумент = Новый ТабличныйДокумент; 
	ТабличныйДокумент.АвтоМасштаб		   = Истина;
	ТабличныйДокумент.ОриентацияСтраницы   = ОриентацияСтраницы.Портрет;  
	
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Реализация_ТоварнаяНакладная";
	Макет = ПолучитьМакет("ПФ_MXL_ТоварнаяНакладная");  
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст = ПолучитьТекстЗапросаСведенияДляТоварнаяНакладная();  
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Пока Выборка.Следующий() Цикл 
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакета.Параметры.Основание = Выборка.ДокументОснование;
		ДанныеОрганизации = ОрганизацииСервер.СведенияОбОрганизации(Выборка.Организация);
		Если ЗначениеЗаполнено(ДанныеОрганизации) Тогда
			ОбластьМакета.Параметры.ПредставлениеОрганизации = ДанныеОрганизации.ПредставлениеОрганизации + ", ИНН: " + ДанныеОрганизации.ИНН;
		КонецЕсли;
		ОбластьМакета.Параметры.ПредставлениеПокупателя = Выборка.ПредставлениеПокупателя;
		ТабличныйДокумент.Вывести(ОбластьМакета);   
		
		ОбластьМакета = Макет.ПолучитьОбласть("ДатаНомерДокумента");
		ОбластьМакета.Параметры.НомерДокумента = Выборка.НомерДокумента; 
		ОбластьМакета.Параметры.ДатаДокумента = Формат(Выборка.ДатаДокумента, "ДФ=dd.MM.yyyy");
		ТабличныйДокумент.Вывести(ОбластьМакета);   
		
		ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокТабличнойЧасти");
		ТабличныйДокумент.Вывести(ОбластьМакета);   
		
		ОбластьМакета = Макет.ПолучитьОбласть("Строка");
		НомерТовара = 0;  
		ИтогКоличество = 0;
		ИтогСумма = 0;
		ВыборкаТовары = Выборка.Товары.Выбрать();
		Если ВыборкаТовары.Количество() Тогда
			Пока ВыборкаТовары.Следующий() Цикл 
				НомерТовара = НомерТовара + 1;
				ОбластьМакета.Параметры.Номер = НомерТовара;
				ОбластьМакета.Параметры.Заполнить(ВыборкаТовары);
				ТабличныйДокумент.Вывести(ОбластьМакета, ВыборкаТовары.Уровень()); 
				ИтогКоличество = ИтогКоличество + ВыборкаТовары.Количество;
				ИтогСумма = ИтогСумма + ВыборкаТовары.Сумма;
			КонецЦикла;
		КонецЕсли;   
		
		ВыборкаУслуги = Выборка.Услуги.Выбрать();
		Если ВыборкаУслуги.Количество() Тогда
			Пока ВыборкаУслуги.Следующий() Цикл 
				НомерТовара = НомерТовара + 1;
				ОбластьМакета.Параметры.Номер = НомерТовара;
				ОбластьМакета.Параметры.Заполнить(ВыборкаУслуги);
				ТабличныйДокумент.Вывести(ОбластьМакета, ВыборкаУслуги.Уровень()); 
				ИтогКоличество = ИтогКоличество + ВыборкаУслуги.Количество;
				ИтогСумма = ИтогСумма + ВыборкаУслуги.Сумма;
			КонецЦикла;
		КонецЕсли; 
		
		ОбластьМакета = Макет.ПолучитьОбласть("Всего"); 
		ОбластьМакета.Параметры.ИтогКоличество = ИтогКоличество; 
		ОбластьМакета.Параметры.ИтогСуммы = ИтогСумма;
		ТабличныйДокумент.Вывести(ОбластьМакета); 
		
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал"); 
		ОбластьМакета.Параметры.СуммаПрописью = ЧислоПрописью(Выборка.СуммаДокумента, "", "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");
		ОбластьМакета.Параметры.КоличествоПорядковыхНомеровЗаписейПрописью = ЧислоПрописью(НомерТовара, ,",,,,,,,,0");
		Если ЗначениеЗаполнено(ДанныеОрганизации) Тогда
			ОбластьМакета.Параметры.ФИОГлавБухгалтера = ДанныеОрганизации.ГлавныйБухгалтер;
			ОбластьМакета.Параметры.ФИОРуководителя = ДанныеОрганизации.Руководитель; 
			ОбластьМакета.Параметры.ДолжностьРуководителя = ДанныеОрганизации.ДолжностьРуководителя; 
			ОбластьМакета.Параметры.ДолжностьСотрудника = Выборка.ДолжностьСотрудника;
			ОбластьМакета.Параметры.ФИОСотрудника = Выборка.Сотрудник; 
			ОбластьМакета.Параметры.ДатаДокументаДень = Формат(Выборка.ДатаДокумента, "ДФ=dd");   
			ОбластьМакета.Параметры.ДатаДокументаМесяц = Формат(Выборка.ДатаДокумента, "ДФ=MMMM"); 
			ОбластьМакета.Параметры.ДатаДокументаГод = Формат(Выборка.ДатаДокумента, "ДФ=yyyy");
		КонецЕсли;		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПолучитьТекстЗапросаСведенияДляТоварнаяНакладная()
		
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Реализация.Номер КАК НомерДокумента,
	|	Реализация.Дата КАК ДатаДокумента,
	|	Реализация.Организация КАК Организация,
	|	Реализация.ДокументОснование КАК ДокументОснование,
	|	Реализация.Контрагент КАК Контрагент,
	|	ПРЕДСТАВЛЕНИЕ(Реализация.Контрагент) КАК ПредставлениеПокупателя,
	|	Реализация.Сотрудник КАК Сотрудник,
	|	Реализация.Сотрудник.Должность КАК ДолжностьСотрудника,
	|	Реализация.СуммаДокумента КАК СуммаДокумента,
	|	Реализация.Товары.(
	|		НомерСтроки КАК НомерСтроки,
	|		Номенклатура КАК ТоварНаименование,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		Сумма КАК Сумма,
	|		Номенклатура.Код КАК ТоварКод
	|	) КАК Товары,
	|	Реализация.Услуги.(
	|		НомерСтроки КАК НомерСтроки,
	|		Услуга КАК ТоварНаименование,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		Сумма КАК Сумма,
	|		Услуга.Код КАК ТоварКод
	|	) КАК Услуги
	|ИЗ
	|	Документ.Реализация КАК Реализация
	|ГДЕ
	|	Реализация.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";	 
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти  

#Область Отладка

Функция ПечатьОтладка(МассивОбъектов) Экспорт
    
    ТабличныйДокумент = СформироватьТоварнаяНакладная(МассивОбъектов, Новый СписокЗначений, ); 
    Возврат ТабличныйДокумент; 
    
КонецФункции
    
#КонецОбласти

#КонецЕсли