
&НаСервере
Функция ЗаписатьсяНаСервере() 
	
	Если ЗначениеЗаполнено(Объект.ДатаЗаписи) И Объект.ДатаЗаписи >= НачалоДня(ТекущаяДата()) Тогда
		
		ЗаписьКлиента = Документы.ЗаписьКлиента.СоздатьДокумент();
		ЗаписьКлиента.Дата        = НачалоМинуты(Объект.ДатаЗаписи);
		ЗаписьКлиента.Сотрудник = Объект.Сотрудник;
		
		СтрокаУслуги = ЗаписьКлиента.Услуги.Добавить();
		СтрокаУслуги.Услуга        = Объект.Услуга;
		СтрокаУслуги.Стоимость    = ЭтаФорма.Стоимость;       
		
		СтруктураРеквизитовДокумента = Новый Структура;
		СтруктураРеквизитовДокумента.Вставить("ДатаЗаписи", Объект.ДатаЗаписи);
		СтруктураРеквизитовДокумента.Вставить("Сотрудник", Строка(Объект.Сотрудник));
		СтруктураРеквизитовДокумента.Вставить("Клиент", Строка(ПараметрыСеанса.ТекущийПользователь)); 
		СтруктураРеквизитовДокумента.Вставить("СуммаДокумента", ЭтаФорма.Стоимость);
		
		МассивУслуг = Новый Массив;
		
		Услуга = Новый Структура;
		Услуга.Вставить("Услуга", Строка(Объект.Услуга));
		Услуга.Вставить("Цена", ЭтаФорма.Стоимость);
		Услуга.Вставить("Количество", 1);
		Услуга.Вставить("Сумма", ЭтаФорма.Стоимость);
		
		МассивУслуг.Добавить(Услуга);
		СтруктураРеквизитовДокумента.Вставить("МассивУслуг", МассивУслуг);
		
		СтруктураРеквизитовДокументаJSON = ОбменСОсновнойБазой.ПолучитьТекстJSON(СтруктураРеквизитовДокумента);
		
		ДокументУспешноОтправлен = ОбменСОсновнойБазой.ОтправитьЗаписьВЦентральнуюБазу(СтруктураРеквизитовДокументаJSON);
		Если ДокументУспешноОтправлен Тогда        
			ЗаписьКлиента.Записать(РежимЗаписиДокумента.Проведение);
			
			Результат = СтрШаблон("Вы записаны на услугу ""%1"" к мастеру %2 на дату %3", 
			Объект.Услуга, Объект.Сотрудник, Формат(Объект.ДатаЗаписи, "ДФ='dd.MM.yyyy HH:mm'"));
			
			Объект.ДатаЗаписи    = '00010101';
			Объект.Сотрудник    = Справочники.Сотрудники.ПустаяСсылка();
			Объект.Услуга        = Справочники.Услуги.ПустаяСсылка();
			ЭтаФорма.Стоимость  = 0; 
			
			Возврат Результат;
		Иначе    
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст    = "Не удалось отправить Запись!";
			СообщениеПользователю.Сообщить();
		КонецЕсли;  	
		
	Иначе 
		
		Объект.ДатаЗаписи = НачалоМинуты(ТекущаяДата());	
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = СтрШаблон("Запись на прошлую дату или незаполненную дату невозможна!");
		СообщениеПользователю.Сообщить();   
		
	КонецЕсли;	
	
КонецФункции

&НаКлиенте
Процедура Записаться(Команда)
	Результат = ЗаписатьсяНаСервере(); 
	Если Результат <> Неопределено Тогда  
		ОповеститьОбИзменении(Тип("ДокументСсылка.ЗаписьКлиента"));
		ОткрытьФорму("Документ.ЗаписьКлиента.Форма.ФормаСписка");  
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = Результат;                                    
		СообщениеПользователю.Сообщить();
	КонецЕсли
КонецПроцедуры

&НаСервере
Процедура УслугаПриИзмененииНаСервере()
	ЭтаФорма.Стоимость = Объект.Услуга.Стоимость;
КонецПроцедуры

&НаКлиенте
Процедура УслугаПриИзменении(Элемент)
	УслугаПриИзмененииНаСервере();
КонецПроцедуры
