
&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры    

&НаКлиенте
Процедура УстановитьВидимость()   
	
	СтрокаТипПлательщика = "";
	Если Объект.ВидОперации =  ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступленияДенег.ВозвратОтПодотчётника") Тогда 
		СтрокаТипПлательщика = "СправочникСсылка.Сотрудники";
		Элементы.Договор.Видимость = Ложь; 
	Иначе            
		СтрокаТипПлательщика = "СправочникСсылка.Контрагенты"; 
		Элементы.Договор.Видимость = Истина;
		
		Плательщик = Объект.Плательщик;
		
		Если ЗначениеЗаполнено(Плательщик) Тогда
			ТипКонтрагента = ПолучитьТипКонтрагентаПоПлательщику(Плательщик); 
			Если ЗначениеЗаполнено(ТипКонтрагента) Тогда	
				Если ТипКонтрагента = ПредопределенноеЗначение("Перечисление.ТипыКонтрагентов.Клиент") Тогда
					Элементы.Договор.Видимость = Ложь; 
				Иначе
					Элементы.Договор.Видимость = Истина; 
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;  
	
	Если ЗначениеЗаполнено(СтрокаТипПлательщика) Тогда        
		Массив = Новый Массив();
		Массив.Добавить(Тип(СтрокаТипПлательщика));    
		ОписаниеТипаПлательщика = Новый ОписаниеТипов(Массив);
		Элементы.Плательщик.ОграничениеТипа = ОписаниеТипаПлательщика;        
	КонецЕсли;
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПолучитьТипКонтрагентаПоПлательщику(Плательщик)
    ТипКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Плательщик, "ТипКонтрагента");
    Возврат ТипКонтрагента;
КонецФункции

&НаКлиенте
Процедура ПлательщикПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.Ответственный) Тогда
		Объект.Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры

        
