Функция РассчитатьДлительностьУслуг(ТЧУслуги)
        
    ТабДанные = ТЧУслуги.Выгрузить(, "Услуга, Количество");	
	
    Запрос = Новый Запрос;
    Запрос.УстановитьПараметр("ТЧУслуги", ТабДанные);    
	
    Запрос.Текст =
        "ВЫБРАТЬ
        |    ТЧ.Услуга КАК Услуга,
        |    ТЧ.Количество КАК Количество
        |ПОМЕСТИТЬ ВТ_ТЧУслуги
        |ИЗ
        |    &ТЧУслуги КАК ТЧ
        |;
        |
        |////////////////////////////////////////////////////////////
        |ВЫБРАТЬ
        |    ЕстьNULL(СУММА(ВТ.Количество * ЕстьNULL(Ном.ДлительностьУслуги, 0)), 0) КАК ДлительностьУслуги
        |ИЗ
        |    ВТ_ТЧУслуги КАК ВТ
        |        ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
        |        ПО ВТ.Услуга = Ном.Ссылка";
    
    Рез = Запрос.Выполнить();
    
    Если Рез.Пустой() Тогда
        Возврат 0;
    КонецЕсли;
    
    Выборка = Рез.Выбрать();
    Выборка.Следующий();
    
    Возврат Выборка.ДлительностьУслуги;
    
КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
            
    ДлительностьВМинутах = РассчитатьДлительностьУслуг(Услуги);
    
    Если ДлительностьВМинутах = 0 Тогда 
        ДлительностьВМинутах = 60; 
    КонецЕсли;
    
    ДатаОкончанияЗаписи = ДатаЗаписи + ДлительностьВМинутах * 60; 
    
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим) 
	
	Движения.ЗаказыКлиентов.Записывать = Истина;
	Движения.ЗаказыКлиентов.Записать();
	Движение = Движения.ЗаказыКлиентов.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Организация = Организация;
	Движение.Клиент = Клиент;
	Движение.ЗаказКлиента = Ссылка;
	Движение.Сумма = СуммаДокумента;  
	
КонецПроцедуры
