
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Товары.ТекущиеДанные;
	РаботаСТабличнымиЧастямиКлиент.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ); 
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Товары.ТекущиеДанные;
	РаботаСТабличнымиЧастямиКлиент.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);
КонецПроцедуры  

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	ПересчитатьСуммуДокумента();
КонецПроцедуры  

&НаКлиенте
Процедура ПересчитатьСуммуДокумента()
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
КонецПроцедуры 

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Услуги.ТекущиеДанные;
	РаботаСТабличнымиЧастямиКлиент.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Услуги.ТекущиеДанные;
	РаботаСТабличнымиЧастямиКлиент.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);
КонецПроцедуры    

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	ПересчитатьСуммуДокумента();
КонецПроцедуры  

&НаСервереБезКонтекста
Функция ПолучитьСтатьюЗатратПоНоменклатуре(Номенклатура)

    Если Не ЗначениеЗаполнено(Номенклатура) Тогда
        Возврат Неопределено;
    КонецЕсли;

	СтатьяЗатрат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "СтатьяЗатрат");
    Возврат СтатьяЗатрат;

КонецФункции

&НаКлиенте
Процедура УслугиУслугаПриИзменении(Элемент)

    СтрокаТЧ = Элементы.Услуги.ТекущиеДанные;
    Если ЗначениеЗаполнено(СтрокаТЧ.Услуга) Тогда
        СтатьяЗатрат = ПолучитьСтатьюЗатратПоНоменклатуре(СтрокаТЧ.Услуга);
        СтрокаТЧ.СтатьяЗатрат = СтатьяЗатрат;
    Иначе
        СтрокаТЧ.СтатьяЗатрат = Неопределено;
    КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.Ответственный) Тогда
		Объект.Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
КонецПроцедуры

