
&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры 

&НаКлиенте
Процедура УстановитьВидимость()  
	
	СтрокаТипПолучателя = "";
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходаДенег.ВыдачаПодотчётнику") Тогда
		СтрокаТипПолучателя = "СправочникСсылка.Сотрудники"; 
		Элементы.Договор.Видимость = Ложь;

	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходаДенег.ВыдачаЗаработнойПлаты") Тогда 
		СтрокаТипПолучателя = "СправочникСсылка.Сотрудники"; 
		Элементы.Договор.Видимость = Ложь;
 
	Иначе            
		СтрокаТипПолучателя = "СправочникСсылка.Контрагенты";
		Элементы.Договор.Видимость = Истина;
		
		Получатель = Объект.Получатель;  
		
		Если ЗначениеЗаполнено(Получатель) Тогда
			ТипКонтрагента = ПолучитьТипКонтрагентаПоПолучателю(Получатель); 
			Если ЗначениеЗаполнено(ТипКонтрагента) Тогда	
				Если ТипКонтрагента = ПредопределенноеЗначение("Перечисление.ТипыКонтрагентов.Клиент") Тогда
					Элементы.Договор.Видимость = Ложь; 
				Иначе
					Элементы.Договор.Видимость = Истина; 
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;  
	
	Если ЗначениеЗаполнено(СтрокаТипПолучателя) Тогда        
		Массив = Новый Массив();
		Массив.Добавить(Тип(СтрокаТипПолучателя));    
		ОписаниеТипаПолучателя = Новый ОписаниеТипов(Массив);
		Элементы.Получатель.ОграничениеТипа = ОписаниеТипаПолучателя;        
	КонецЕсли;

КонецПроцедуры 

&НаКлиенте
Процедура ПолучательПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры      

&НаСервереБезКонтекста
Функция ПолучитьТипКонтрагентаПоПолучателю(Получатель)  
    ТипКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Получатель, "ТипКонтрагента");
    Возврат ТипКонтрагента;
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.Ответственный) Тогда
		Объект.Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры



